import { keyframes } from "@emotion/react";
import { MMR, alishir, instagram, kiumad, linkedin, mahnaz, option1, option2, option3, rezanilforoushan, sanihb, twitter, vahidStar } from "../assets";

export const navLinks = [
    {
        id: "1",
        title: "بلوجونیور",
    },
    {
        id: "2",
        title: "موقعیت شغلی",
    },
    {
        id: "3",
        title: "سوالات متداول",
    },
    {
        id: "4",
        title: "بلاگ",
    },
    {
        id: "5",
        title: "درباره ما",
    },
];

export const account = [
    {
        id: "1",
        title: "بدون حداقل موجودی حساب",
        paragraph: "در بلو برای بازکردن حساب، نیاز به حتی یک ریال موجودی نیست.",
        icon: option1
    },
    {
        id: "2",
        title: "بدون کارمزد بازکردن حساب",
        paragraph: "در بلو بازکردن حساب کاملا رایگان است و نیاز به پرداخت هیچ کارمزدی ندارد.",
        icon: option2
    },
    {
        id: "3",
        title: "۵ درصد سود سپرده",
        paragraph: "در بلو برای حداقل مانده موجودی در ماه، سود سالیانه ۵ درصد به صورت ماه‌شمار پرداخت می‌شود.",
        icon: option3
    },
]

export const comments = [
    {
        id: "1",
        name: "@vahidStar",
        comment: "والا من از روزی که رسید دستم همه بانکامو منتقل کردم بهش.‌ یکی دوتا مشکل هم باهاش داشتم که تیم پشتیبا...",
        image: vahidStar,
        icon: twitter,
        color: "#3094ea",
    },
    {
        id: "2",
        name: "rezanilforoushan.pv",
        comment: "واقعا رابط کاربری اپلیکیشن فوق العاده خوب و راحته. تبریک میگم بهتون من ک بی صبرانه منتظرم کارت بانکی...",
        image: rezanilforoushan,
        icon: instagram,
        color: "#e7406d",
    },
    {
        id: "3",
        name: "sani.hb",
        comment: "واقعا فوق العاده است! تا حالا اینهمه حس خوب نسبت ب کارت بانکیم و بانک نداشتم  😍",
        image: sanihb,
        icon: instagram,
        color: "#e7406d",
    },
    {
        id: "4",
        name: "mahnaz.asgari.pv",
        comment: "من کارتم رسید بسیار عالی و راحت فعال شدامروز هم با مبلغ هدیه ای که واریز کرده بودید خرید کردم 😍",
        image: mahnaz,
        icon: instagram,
        color: "#e7406d",
    },
    {
        id: "5",
        name: "ali shirdastian",
        comment: "امروز کارت اعتباری #بلو رسید دستم. الحق که پکینگ و هویت بصری‌ش حس اعتماد و احترام خیلی خوبی بهم داد....",
        image: alishir,
        icon: linkedin,
        color: "#3094ea",
    },
    {
        id: "6",
        name: "Mohammad Mehdi Roshani",
        comment: "کارت blu Bank منم رسید. ببینیم سرنوشتش چی میشه...بسته بندی و طراحی کارتشون قشنگ بود.خوشمان آمد",
        image: MMR,
        icon: linkedin,
        color: "#3094ea",
    },
    {
        id: "7",
        name: "@kiumad",
        comment: "به به ، بلوکارت منم رسیییید 😍👍از نظر برندینگ و دیجیتال مارکتینگ واقعا عالی اومدن جلو ، حقشونه که ب...",
        image: kiumad,
        icon: linkedin,
        color: "#3094ea",
    },
]

export const accordions = [
    {
        id: "1",
        title: "چگونه می‌توانم حساب بازکنم؟",
        text: "مراحل بازکردن حساب : ١.دانلود و نصب اپلیکیشن بلو ٢.داشتن یک خط تلفن همراه فعال که به نام خودتان است ٣.همراه داشتن اصل کارت ملی (برای کارت ملی‌های قدیمی، کد رهگیری درخواست صدور کارت هوشمند) برای ارسال تصاویر مربوطه"
    },
    {
        id: "2",
        title: "برای بازکردن حساب چه مدارکی لازم است؟",
        text: "اصل کارت ملی (برای کارت ملی‌های قدیمی، کد رهگیری درخواست صدور کارت هوشمند) برای ارسال تصاویر مربوطه و داشتن یک خط تلفن همراه فعال که به نام خودتان است."
    },
    {
        id: "3",
        title: "من کارت ملی هوشمند دریافت نکرده‌ام، آیا می‌توانم حساب بازکنم؟",
        text: "بله، اگر درخواست کارت ملی هوشمند را ثبت کردید، از راه ثبت کد رهگیری نوشته شده روی رسید ثبت‌نام کارت ملی هوشمند، امکان بازکردن حساب را دارید."
    },
    {
        id: "4",
        title: "من کارت ملی هوشمند ندارم و برگه رسید کارت ملی هوشمند را گم کرده‌ام، چطور می‌توانم حساب بازکنم؟",
        text: "در وب‌سایت سازمان ثبت و احوال کد رهگیری کارت ملی خود را پیداکنید و فرآیند بازکردن حساب را انجام دهید."
    },
    {
        id: "5",
        title: "مراحل بازکردن حساب چقدر زمان می‌برد؟",
        text: "باز کردن حساب در کمتر از ۷ دقیقه، بررسی مدارک، شناسایی هویت و فعال شدن حساب(در صورت تایید استعلام بانک مرکزی) حداکثر تا ۳ روز انجام می‌شود."
    },
]